Repository: cscenter/lms
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Student Group Assignees
ru: Ответственные студенческих групп

source: User is not a course teacher of the selected student group
ru: Пользователь не является преподавателем выбранной группы

source: Student groups teachers bucket
ru: Бакет распределения проверяющих

source: Student groups teachers buckets
ru: Бакеты распределения проверяющих

source: Assignment Group
ru: Группа для задания

source: Assignment Groups
ru: Группы для задания

source: Course Class
ru: Занятие

source: Leave blank to fill in with the date of the beginning of the term
ru: Если оставить пустым, то будет заполнено датой начала семестра

source: Inclusive. Leave blank to calculate based on a default duration ({} days)
ru: Включительно. Оставьте пустым, чтобы вычислить дедлайн записи на курсы на основе стандартной длительности периода ({} дн.)

source: Enrollment Period
ru: Период записи на курсы

source: Enrollment Periods
ru: Периоды записи на курсы

source: Start of the enrollment period should be inside term boundaries
ru: Начало периода записи должно быть в пределах семестра

source: Deadline should be later than the expected term start ({})
ru: Последний день записи на курсы должен быть >= предполагаемого начала семестра ({})

source: Student Profile
ru: Профиль студента

source: Enrollment|grade
ru: Оценка

source: This flag is used to represent that set grade is recredited. Use it with satisfactory grades.
ru: Эта галочка используется для обозначение того, что выставленная положительная оценка перезачтена.

source: The student left the course
ru: Студент покинул курс

source: Entry reason
ru: Причина поступления

source: Leave reason
ru: Причина ухода

source: Enrollment
ru: Запись на курс

source: Enrollments
ru: Записи на курсы

source: Student group must refer to one of the student groups of the selected course
ru: Значение должно указывать на одну из групп выбранного курса.

source: Can not be used with re-credit grade
ru: Не используется с оценкой "Перезачтено (без оценки)"

source: Can not be used with unsatisfactory grades
ru: Используйте зачетную оценку

source: Satisfactory
ru: Удовлетворительно

source: Entry Added
ru: Дата изменения

source: Source
ru: Источник

source: Course Invitation
ru: Приглашение на курс

source: CourseInvitation|capacity
ru: Максимальное кол-во студентов

source: Enrollment Invitation
ru: Приглашение на курс

source: Enrollment Invitations
ru: Приглашения на курсы

source: Course semester should match invitation semester
ru: Семестр курса не совпадает с семестром приглашения

source: Invitations
ru: Приглашения

source: StudentAssignment|assignment
ru: Задание

source: StudentAssignment|student
ru: Студент

source: StudentAssignment|Status
ru: Статус

source: Assignment|grade changed
ru: Оценка изменена

source: Student Assignment Watchers
ru: Персональное задание

source: Execution Time
ru: Время выполнения

source: The time spent by the student executing this task
ru: Время, потраченное на выполнение задания

source: Personal Assignment
ru: Персональное задание

source: Personal Assignments
ru: Персональные задания

source: Grade can't be larger than maximum one ({0})
ru: Оценка не может быть больше максимальной ({0})

source: Assignment score audit log
ru: Лог изменения оценки

source: Solution
ru: Решение

source: AssignmentComment|student_assignment
ru: Выполнение задания

source: AssignmentComment|Type
ru: Тип

source: Solution Execution Time
ru: Затраченное время

source: The time spent by the student executing this submission
ru: Время, затраченное студентом на выполнение посылки

source: Published
ru: Опубликовано

source: AssignmentComment|text
ru: Текст

source: LaTeX+Markdown is enabled
ru: доступны LaTeX и Markdown

source: Attached File
ru: Приложенный файл

source: Assignment-comment
ru: Комментарий к заданию

source: Assignment-comments
ru: Комментарии к заданиям

source: Assignment Submission Attachment
ru: Приложенный файл

source: Assignment Submission Attachments
ru: Приложенные файлы

source: student_assignment
ru: Выполнение задания

source: About passed assignment
ru: О сданном задании

source: About created assignment
ru: О сданном задании

source: About change of deadline
ru: О смене времени сдачи

source: Unread
ru: Не прочтено

source: User is notified
ru: Пользователь оповещён

source: Assignment notification
ru: Уведомление о заданиях

source: Assignment notifications
ru: Уведомления о заданиях

source: Only teachers can receive notifications of passed assignments
ru: Только преподаватели могут получать оповещения о сданных заданиях

source: Course offering news
ru: Новости прочтений

source: Course offering news notification
ru: Оповещение о новостях прочтений

source: Course offering news notifications
ru: Оповещения о новостях прочтений

source: Non-course event
ru: Событие

source: Non-course events
ru: События

source: Event should end after it's start
ru: Конец события должен быть позже начала

source: Visibility
ru: Видимость

source: Graduated on
ru: Дата выпуска

source: Graduation ceremony date
ru: Дата выпускного считается датой выпуска студента

source: Fields of study
ru: Направления обучения

source: Academic disciplines that the student graduated from
ru: Направления, с которых выпустился студент.

source: Graduation Year
ru: Год выпуска

source: Photo
ru: Фото

source: Testimonial
ru: Отзыв

source: Testimonial about Computer Science Center
ru: Отзыв о CS центре

source: Details
ru: Детали

source: Diploma Number
ru: Номер диплома

source: Registration Number
ru: Регистрационный номер

source: Registration number in the registry of education
ru: Номер в федеральном реестре (ФРДО)

source: Diploma Issued on
ru: Дата выдачи диплома

source: Graduate Profile
ru: Профиль выпускника

source: Graduate Profiles
ru: Профили выпускников

source: User url
ru: Профиль на сайте

source: Curator
ru: Куратор

source: Co-worker
ru: Сотрудник

source: Master's Degree Student
ru: Студент магистратуры

source: Invited User
ru: Приглашенный студент

source: Graduate
ru: Выпускник

source: At least one of text, file, meta.score, meta.status must be provided
ru: Хотя бы одно из полей: текст, файл, оценка, статус должно быть изменено или заполнено.

source: The score or status has been changed by someone. Review the changes to resolve the conflict.
ru: Оценка или статус уже были кем-то изменены. Посмотрите изменения и пересохраните форму, если потребуется.

source: Saint Petersburg
ru: Санкт-Петербург

source: Novosibirsk
ru: Новосибирск

source: Branches|Distance
ru: Заочное отделение

source: 1 course bachelor, speciality
ru: 1 курс (бакалавриат, специалитет, СПО)

source: 2 course bachelor, speciality
ru: 2 курс (бакалавриат, специалитет, СПО)

source: 3 course bachelor, speciality
ru: 3 курс (бакалавриат, специалитет, СПО))

source: 4 course bachelor, speciality
ru: 4 курс (бакалавриат, специалитет, СПО))

source: 5 course speciality
ru: 5 курс специалитета

source: 6 course speciality
ru: 6 курс специалитета

source: 1 course magistracy
ru: 1 курс (магистратура)

source: 2 course magistracy
ru: 2 курс (магистратура)

source: postgraduate
ru: Аспирант

source: academic_leave
ru: Нахожусь в академе

source: Other
ru: Другое

source: EnrollmentTypes|Regular
ru: Сдавать

source: EnrollmentTypes|Lections
ru: Только слушать

source: InvitationEnrollmentTypes|Regular
ru: Сдавать

source: InvitationEnrollmentTypes|Lections
ru: Только слушать

source: InvitationEnrollmentTypes|Any
ru: На выбор

source: Invitation|University
ru: ВУЗы

source: Invitation|Staff
ru: Сотрудники

source: Invitation|Teacher
ru: Преподаватели

source: Invitation|Guest
ru: Гости

source: Invitation|Aacdemic
ru: Академ

source: Invitation|Graduate
ru: Выпускники

source: Invitation|Applicant
ru: Абитуриенты

source: StudentInfo|Expelled
ru: Отчислен

source: StudentStatus|Academic leave
ru: Академический отпуск

source: Second academic leave
ru: Второй академический отпуск

source: StudentInfo|Reinstalled
ru: Восстановлен

source: StudentInfo|Will graduate
ru: Будет выпускаться

source: StudentInfo|Graduate
ru: Выпускник

source: Default
ru: По умолчанию

source: Pass/Fail
ru: Зачет/Незачет

source: Pass/Fail + Excellent
ru: Зачет/Незачет + Отлично

source: 10-point scale
ru: 10-балльная шкала

source: Not graded
ru: Без оценки

source: Without Grade
ru: Не оценивается

source: Enrollment|Unsatisfactory
ru: Незачёт

source: Enrollment|Pass
ru: Зачёт

source: Good
ru: Хорошо

source: Excellent
ru: Отлично

source: Enrollment|Re-credit
ru: Перезачтено (без оценки)

source: Gradebook
ru: Ведомость

source: Imported from CSV by Yandex.Login
ru: Импорт из CSV-файла по Яндекс.Логину

source: Imported from CSV by stepik.org ID
ru: Импорт из CSV-файла по stepik.org ID

source: Imported from CSV by LMS Student ID
ru: Импорт из CSV-файла по идентификатору студента

source: Admin Panel
ru: Админ-панель

source: Auto change on type change with admin panel
ru: Автоматическое изменение при изменении типа в админ-панели

source: Form on Assignment Detail Page
ru: Страница задания студента

source: Gerrit Webhook
ru: Геррит

source: Update Draft
ru: Обновить черновик

source: Save Draft
ru: Сохранить черновик

source: Send Comment
ru: Отправить комментарий

source: Comment successfully saved
ru: Комментарий успешно сохранен.

source: Solution successfully saved
ru: Решение успешно сохранено.

source: CourseTab|Contacts
ru: Контакты

source: CourseTab|News
ru: Новости

source: CourseTab|Reviews
ru: Отзывы

source: News
ru: Новости

source: Learner places available
ru: Осталось мест сдавать

source: Listener places available
ru: Осталось мест слушать

source: Enroll in
ru: Записаться

source: {} hrs {:02d} min
ru: {} ч. {:02d} мин.

source: No places available, sorry
ru: Извините, свободных мест не осталось.

source: You are successfully enrolled in the course
ru: Вы успешно записались на курс

source: You are already enrolled in the course
ru: Вы уже записаны на этот курс

source: Copies available
ru: Доступно

source: Book
ru: Книга

source: Library
ru: Библиотека

source: Book Tag
ru: Тег книги

source: Book Tags
ru: Теги

source: Tag
ru: Тег

source: Book|author
ru: Автор

source: Book|title
ru: Заголовок

source: Book|description
ru: Описание

source: Book|cover
ru: Обложка

source: book
ru: Книга

source: books
ru: Книги

source: Book|number of copies
ru: Количество копий

source: Stock
ru: Резерв

source: Stocks
ru: Резервы

source: Borrow|student
ru: Студент

source: Borrow|borrowed on
ru: Взято

source: Borrowed Book
ru: Взятая книга

source: Borrowed Books
ru: Взятые книги

source: Book|read by
ru: Читают

source: Edit
ru: Редактировать

source: library
ru: Библиотека

source: Book|number of copies left
ru: Количество оставшихся копий

source: Check if you want to save related notifications in DB, but show, that you are not using this notification type anymore.
ru: Отметьте, если хотите сохранить связанные уведомления и показать, что этот тип нотификаций больше не используется.

source: Types
ru: Типы

source: Notification
ru: Уведомление

source: Field of study
ru: Направление обучения

source: Former field of study
ru: Прошлое направление обучения

source: Is processed
ru: Обработан ли

source: Download
ru: Скачать

source: Mark processed
ru: Обработать

source: Studying
ru: Учится

source: Former status
ru: Прошлый статус

source: Date of Graduation
ru: Дата выпуска

source: Major User email
ru: Почта основного пользователя

source: Minor User email
ru: Почта дублирующего пользователя

source: Merge Users
ru: Объединить пользователей

source: There is no User with this email
ru: Пользователя с такой почтой не существует

source: Emails must not be the same
ru: Почты должны различаться

source: CSV file
ru: Файл CSV

source: Fill in badge numbers
ru: Залить номера пропусков

source: CSV file must contain "Email" and "Badge number" columns
ru: Файл CSV должен содержать колонки с заголовками «Почта» и «Номер пропуска»

source: Warehouse
ru: Склад

source: First part of semester
ru: В первой половине семестра

source: Second part of semester
ru: Во второй половине семестра

source: No courses yet
ru: Список курсов пуст

source: Average grade
ru: Средний балл

source: Statistics
ru: Статистика

source: Study Programs
ru: Учебные программы

source: PK|Code
ru: Код

source: AreaOfStudy|Name
ru: Название

source: AcademicDiscipline|hours
ru: Общее кол-во часов

source: AcademicDiscipline|cover
ru: Обложка

source: AcademicDiscipline|icon
ru: Иконка

source: AreaOfStudy|description
ru: Описание

source: Area of study
ru: Направление обучения

source: Areas of study
ru: Направления обучения

source: Area of Study
ru: Направление обучения

source: Activity
ru: Активность

source: Show on syllabus page. Other activity flags for selected branch and academic discipline will be deactivated.
ru: Активная программа будет показана на странице программы. Все другие записи для выбранного отделения и направления обучения будут деактивированы.

source: StudyProgram|description
ru: Доп. описание

source: Study Program
ru: Учебная программа

source: StudyProgramCourseGroup|courses
ru: Курсы

source: Courses will be grouped with boolean OR
ru: Курсы объединяются логическим ИЛИ.

source: Study Program Course
ru: Курс учебной программы

source: Study Program Courses
ru: Обязательные курсы

source: Django site admin
ru: Административная панель Django

source: Django administration
ru: Администрирование Django

source: First Page
ru: Первая страница

source: Previous Page
ru: Предыдущая страница

source: Current Page
ru: Текущая страница

source: Page %(pagenum)s of %(num_pages)s
ru: Страница %(pagenum)s из %(num_pages)s

source: Next Page
ru: Следующая страница

source: Last Page
ru: Последняя страница

source: CSCenter learning venues
ru: Места проведения занятий CSC

source: You (or someone pretending to be you) have asked to register an account at %(site_name)s. If this wasn't you, please ignore this email and your address will be removed from our records.
ru: Вы (или кто-то выдающий себя за вас) оставили заявку на регистрацию учетной записи на %(site_name)s. Если это были не вы, то проигнорируйте это сообщение, и ваш почтовый адрес будет удален из наших записей.

source: Account activation on
ru: Активация учетной записи на

source: Are you sure you want to delete
ru: Вы уверены, что хотите удалить

source: Delete
ru: Удалить

source: International Computer Science Student Schools
ru: Международные студенческие Computer Science школы

source: If you would like a school to be added to this list email the club coordinator: Alexander Kulikov, kulikov()logic.pdmi.ras.ru<br> Subscribe: <a href="https://www.facebook.com/compscischools">Facebook</a>
ru: Список школ также поддерживается в <a href="https://vk.com/compscinews">группе Вконтакте</a> и в группе <a href="https://www.facebook.com/compscischools">в Фейсбуке</a>.<br> Для добавления анонса школы свяжитесь с координатором клуба: Александр Куликов, alexander.s.kulikov@gmail.com.

# international Schools
source: Deadline
ru: Дедлайн

source: Dates
ru: Даты

source: Location
ru: Место проведения

source: Grants
ru: Гранты

source: yes
ru: да

source: no
ru: нет

source: Why did you decide to unenroll in the course?
ru: Почему вы решили отказаться от этого курса?

source: To leave the course
ru: Покинуть курс

source: When
ru: Когда

source: Where
ru: Где

source: Profile Update
ru: Обновление профиля

source: Registration
ru: Регистрация

source: Activation email sent
ru: Письмо с активацией отправлено

source: Please check your email to complete the registration process.
ru: Пожалуйста, проверьте свой email для завершения регистрации.

source: Close
ru: Закрыть

source: Password Reset
ru: Сбросить пароль

source: Forgot?
ru: Забыли пароль?

source: Sign in
ru: Войти

source: For curator
ru: Для куратора

source: Please correct the error below.
ru: Пожалуйста, исправьте ошибку.

source: Please correct the errors below.
ru: Пожалуйста, исправьте ошибки.

source: Password recovery
ru: Восстановление пароля

source: Password successfully changed.
ru: Пароль успешно изменён

source: Password changed
ru: Пароль изменён

source: Change password
ru: Сменить пароль

source: Password change
ru: Изменение пароля

source: Sorry, the link is invalid
ru: Извините, ссылка устарела

source: An email with instructions for setting a new password has been sent
ru: Инструкции по смене пароля были высланы на указанный почтовый адрес

source: Enter your email
ru: Введите ваш email

source: Restore password
ru: Восстановить пароль

source: Reference|Detail|request
ru: Справка дана по месту требования

source: Reference|Detail|title
ru: СПРАВКА

source: Reference|Detail|signature
ru: Куратор в Computer Science центре

source: Reference|Detail|info
ru: Информация

source: Country
ru: Страна

source: Countries
ru: Страны

source: External ID
ru: Внешний ID

source: Display Name
ru: Отображаемое имя

source: Faculty
ru: Факультет

source: Faculties
ru: Факультеты

source: Create Student Profile before adding student permissions
ru: Требуется создать профиль студента перед выдачей роли студента.

source: You have to specify branch for user before adding teacher permissions
ru: Укажите отделение у пользователя перед тем, как выдать ему права преподавателя.

source: Permissions
ru: Разрешения

source: Personal info
ru: Персональная информация

source: External services
ru: Внешние сервисы

source: Important dates
ru: Важные даты

source: Regular student profile already exists for this admission campaign year.
ru: Профиль регулярного студента уже существует для связанной кампании по набору.

source: Student profile with type INVITED must have invitation
ru: Профиль приглашенного студента должен содержать приглашение

source: Official Student Info
ru: Официальный студент

source: Curator's note
ru: Заметка куратора

source: Date of Birth
ru: Дата рождения

source: Users
ru: Пользователи

source: Male
ru: Мужской

source: Female
ru: Женский

source: Other/Prefer Not to Say
ru: Другое / Предпочитаю не сообщать

source: Interviewer [Admission]
ru: Собеседующий [Набор]

source: Project reviewer
ru: Проверяющий [Отчеты]

source: Curator of projects
ru: Куратор проектов

source: SHADCourseGrade|Unsatisfactory
ru: Незачёт

source: SHADCourseGrade|Pass
ru: Удовлетворительно

source: Tell something about yourself
ru: Расскажите что-нибудь о себе

source: will be shown only to logged-in users
ru: показывается только залогиненным пользователям

source: stepik.org/users/<b>USER_ID</b>
ru: stepik.org/users/<b>ID пользователя</b>

source: Specify one or more jobs (comma-separated)
ru: Укажите одно или несколько мест работы через запятую. Пример: JetBrains, Яндекс, ПОМИ РАН

source: name
ru: имя

source: group
ru: группа

source: groups
ru: Группы

source: Access Groups
ru: Права доступа

source: Yandex UID
ru: Яндекс UID

source: first name
ru: Имя

source: last name
ru: Фамилия

source: Real name
ru: Полное имя

source: Data from Yandex.ID
ru: Данные из Яндекс Паспорта

source: A user with that username already exists.
ru: Пользователь с таким именем уже существует.

source: CSCUser|patronymic
ru: Отчество

source: notification permission status
ru: Разрешить уведомления

source: Gender
ru: Пол

source: Phone
ru: Телефон

source: CSCUser|photo
ru: Фото

source: CSCUser|note
ru: Дополнительно

source: Github Login
ru: Логин на github.com

source: Social Networks
ru: Социальные сети

source: will be shown to curators only
ru: будут показаны только кураторам

source: Contact information
ru: Контактная информация

source: Workplace
ru: Место работы

source: Badge number
ru: Номер пропуска

source: T-Shirt size
ru: Размер футболки

source: User citizenship
ru: Гражданство

source: Citizenship code in OKSM system
ru: Цифровой код гражданства по классификации ОКСМ

source: CSCUser|user
ru: Пользователь

source: CSCUser|users
ru: Пользователи

source: Regular Student
ru: Студент

source: Invited Student
ru: Приглашенный студент

source: Partner Tag
ru: Партнер

source: Partner Tags
ru: Партнеры

source: Priority
ru: Приоритет

source: Magistracy
ru: Магистратура

source: Student|admission year
ru: Год поступления

source: StudentInfo|University year
ru: Курс при поступлении

source: StudentInfo|University year (other)
ru: Курс при поступлении (другое)

source: Official Student
ru: Официальный студент

source: Passport, consent for processing personal data, diploma (optional)
ru: Передал данные о паспорте, соглашение о персональных данных, диплом и т.д.

source: Graduate without diploma
ru: Выпускник без диплома

source: StudentProfile|graduation_year
ru: Год выпуска из ВУЗа

source: Paid Basis
ru: Платная форма обучения

source: Alternative track
ru: Альтернативный трек

source: Number of higher education diploma
ru: Номер диплома о высшем образовании

source: Diploma Issued by
ru: Кем выдан диплом

source: Student SNILS
ru: СНИЛС студента

source: Individual insurance account number
ru: Страховой номер индивидуального лицевого счёта

source: Comment changed
ru: Комментарий изменён

source: Author of last edit
ru: Автор последней правки

source: Student Profiles
ru: Профили студентов

source: Designates whether this Log was processed in document list
ru: Был ли этот переход обработан через список для приказов

source: Processed time
ru: Дата обработки

source: Student Log
ru: Лог изменения поля [абстрактный]

source: Student Status Log
ru: Лог изменения статуса

source: Student Academic Discipline Log
ru: Лог изменения направления обучения

source: Online course record
ru: Запись об онлайн-курсе

source: Online course records
ru: Записи об онлайн-курсах

source: SHAD course record
ru: Запись о курсе ШАД

source: SHAD course records
ru: Записи о курсах ШАД

source: Reference|signature
ru: Подпись

source: Reference|note
ru: Текст в свободной форме

source: Student Reference
ru: Справка студента

source: Student References
ru: Справки студента

source: Consent type
ru: Тип согласия

source: User Consent
ru: Согласие пользователя

source: User Consents
ru: Согласия пользователя

source: Major and minor must be objects of the same types
ru: Основной и дублирующий объекты должны быть объектами одного типа

source: Use merge_objects for non User instances
ru: Для объектов не-Пользователей используйте merge_objects

source: User with email "{}" does not exists
ru: Пользователь с почтой «{}» не существует

source: Create reference
ru: Выдать справку

source: Student references
ru: Справки студента

# menu
source: Courses
ru: Курсы

source: List
ru: Список

source: Calendar
ru: Календарь

source: What
ru: Что

source: Video
ru: Видео

source: Other materials
ru: Другие материалы

source: Visibility Settings
ru: Настройки отображения

source: Save and add
ru: Сохранить и добавить ещё

source: [Draft]
ru: [Черновик]

source: Statement
ru: Ведомости

source: Date and time
ru: Дата и время

source: Class|Name
ru: Название

source: Venue|short
ru: Место

source: Materials
ru: Материалы

source: translation
ru: трансляция

source: No
ru: Нет

source: Files
ru: Файлы

source: delete
ru: удалить

source: edit
ru: редактировать

source: Publish course
ru: Опубликовать курс

source: Unenroll from the course
ru: Отписаться от курса

source: Enroll in the course
ru: Записаться на курс

source: Add assignment
ru: Добавить задание

source: Edit description
ru: Редактировать описание

source: Add news
ru: Добавить новость

source: Add class
ru: Добавить занятие

source: Start survey
ru: Оставить отзыв о курсе

source: Course Offerings
ru: Прочтения курсов

source: Import scores from CSV
ru: Импорт оценок из CSV-файла

source: Choose assignment
ru: Выберите задание

source: Score will be imported for selected assignment
ru: Оценки будут импортированы для выбранного задания

source: Choose csv file
ru: Выберите csv-файл

source: Import
ru: Импортировать
