Repository: cscenter/lms
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: User inactive or deleted.
ru: Пользователь деактивирован или удалён.

source: Student ID
ru: ID Студента

source: Curriculum year
ru: Год программы обучения

source: Semester
ru: Семестр

source: Course
ru: Курс

source: Branch
ru: Отделение

source: Student type
ru: Тип студента

source: Student Group
ru: Студенческая группа

source: Teacher
ru: Преподаватель

source: Assignment
ru: Задание

source: Assignment status
ru: Статус задания

source: Assignment Grade
ru: Оценка по заданию

source: Maximum score
ru: Максимальный балл

source: Assignment count
ru: Количество заданий

source: Maximum student score
ru: Максимальный полученный балл

source: Grade
ru: Оценка

source: Grade re-credited
ru: Оценка перезачтена

source: Access Key
ru: Ключ доступа

source: User
ru: Имя пользователя

source: Expire at
ru: Истекает

source: Token
ru: Токен

source: Tokens
ru: Токены

source: External service tag
ru: Тег внешнего сервиса

source: External token
ru: Внешний токен

source: External tokens
ru: Внешние токены

source: Authentication and Authorization
ru: Аутентификация и Авторизация

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: You can also <a href="{0}">restore your password</a>
ru: Вы также можете <a href="{0}">восстановить ваш пароль</a>

source: Login
ru: Войти

source: You haven't enough access rights to login on this site. Contact curators if you think this is wrong.
ru: У вас недостаточно прав для входа на сайт. Свяжитесь с кураторами, если считаете это ошибкой.

source: Code Review
ru: Код-ревью

source: Solution was submitted for code review. Use this link to track progress: {link}.
ru: Решение было отправлено на код-ревью. За ходом проверки Вы можете следить по ссылке: {link}.

source: Update in Gerrit
ru: Обновление в Gerrit

source: Student Assignment
ru: Персональное задание

source: Service User
ru: Служебный пользователь

source: Changed by
ru: Кем изменено

source: Cancel
ru: Отмена

source: Save
ru: Сохранить

source: How to style text read <a href="/commenting-the-right-way/" target="_blank">here</a>. Partially HTML is enabled too.
ru: В вашем распоряжении Markdown, Latex для формул и HTML. Памятку по оформлению можно найти <a href="/commenting-the-right-way/" target="_blank">по ссылке</a>.

source: How to style text read <a href="/commenting-the-right-way/" target="_blank">here</a>.
ru: Как правильно оформлять текст, читайте <a href="/commenting-the-right-way/" target="_blank">по ссылке</a>.

source: Code
ru: Код

source: City name
ru: Название города

source: Abbreviation
ru: Аббревиатура

source: Timezone
ru: Часовой пояс

source: City
ru: Город

source: Cities
ru: Города

source: Branch|Name
ru: Название

source: Established
ru: Год основания

source: Active
ru: Активный

source: Order
ru: Сортировка

source: Branch Location
ru: Местонахождение

source: Site
ru: Сайт

source: Description
ru: Описание

source: Branch|Description
ru: Общее описание, правила обучения

source: Branches
ru: Отделения

source: Location|Name
ru: Название адреса

source: Address
ru: Адрес

source: Should be resolvable by Google Maps
ru: Должен находиться на google-картах

source: Directions
ru: Как добраться

source: Flags
ru: Флаги

source: Class
ru: Занятие

source: Interview
ru: Собеседование

source: Set purpose of this place
ru: Отметьте, какие мероприятия проходят в данном месте.

source: Locations
ru: Адреса

source: Name
ru: Имя

source: University
ru: Университет

source: Universities
ru: Университеты

source: created
ru: Создан

source: modified
ru: изменено

source: Extension '%(extension)s' not allowed. Allowed extensions are: '%(allowed_extensions)s.'
ru: Расширение '%(extension)s' не допустимо. Список разрешённых: '%(allowed_extensions)s.'

source: MIME type '%(mimetype)s' is not valid. Allowed types are: %(allowed_mimetypes)s.
ru: Тип MIME '%(mimetype)s' не допустим. Разрешенные типы: %(allowed_mimetypes)s.

source: The current file %(size)s, which is too small. The minumum file size is %(allowed_size)s.
ru: Размер файла %(size)s недопустим. Минимальный размер файла %(allowed_size)s.

source: The current file %(size)s, which is too large. The maximum file size is %(allowed_size)s.
ru: Размер файла %(size)s недопустим. Максимальный размер файла %(allowed_size)s.

source: CourseReview|text
ru: Текст

source: Created
ru: Дата создания

source: Please, double check the list. Some users are not related to the selected course
ru: Пожалуйста, перепроверьте список выбранных преподавателей. Кто-то из них не имеет отношения к выбранному прочтению курса.

source: Assignment|deadline
ru: Срок сдачи

source: Courses
ru: Курсы

source: Monday
ru: Понедельник

source: Tuesday
ru: Вторник

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: Sunday
ru: Воскресенье

source: spring
ru: весна

source: summer
ru: лето

source: autumn
ru: осень

source: Lecture
ru: Лекция

source: Seminar
ru: Семинар

source: Lecture and seminar
ru: Лекция и семинар

source: Invited lecture
ru: Приглашенная лекция

source: Lecturer
ru: Лектор

source: Reviewer
ru: Проверяющий задания

source: Seminarian
ru: Семинарист

source: Spectator
ru: Наблюдатель

source: Organizer
ru: Организатор

source: All Users
ru: Все пользователи

source: All Students
ru: Все студенты

source: Course Participants
ru: Слушатели курса

source: Online Submission
ru: Через сайт

source: Yandex.Contest
ru: Яндекс.Контест

source: External Service
ru: Внешний сервис

source: Code Review Submission
ru: Задача с код-ревью

source: Penalty
ru: Штраф

source: No Submission
ru: Без отправки решения

source: AssignmentStatus|New
ru: Создано

source: AssignmentStatus|Not submitted
ru: Не сдано

source: AssignmentStatus|On checking
ru: На проверке

source: AssignmentStatus|Need fixes
ru: Ждёт исправления

source: AssignmentStatus|Completed
ru: Выполнено

source: Without a responsible person
ru: Без ответственного

source: Choose from the list
ru: Вручную

source: Student Group - Default
ru: Студенческие группы по умолчанию

source: Student Group - Custom
ru: Студенческие группы вручную

source: Student Group - Balanced
ru: Студенческие группы сбалансированно

source: To all groups
ru: Всем группам

source: Course|name
ru: Название

source: Course|description
ru: Описание

source: Title
ru: Название

source: Text
ru: Текст

source: Venue
ru: Место проведения

source: Type
ru: Тип

source: CourseClass|Name
ru: Название

source: Do not use words "Lecture", "Lesson", "Seminar". Fill in only name of the theme
ru: Не используйте слова "Лекция", "Занятие" или "Семинар". Используйте только название темы.

source: Materials (presentations, instructions, reminders)
ru: Материалы (презентации, инструкции, памятки)

source: You can select multiple files
ru: Вы можете выбрать несколько файлов

source: Date
ru: Дата

source: Format: dd.mm.yyyy
ru: Формат: дд.мм.гггг

source: Starts at
ru: Начало

source: Format: hh:mm
ru: Формат: чч:мм

source: Ends at
ru: Конец

source: Time Zone
ru: Часовой пояс

source: Repeated classes
ru: Повторяющиеся занятия

source: Number of repeats
ru: Кол-во повторений

source: Student Groups
ru: Студенческие группы

source: Restrict course class visibility in the student schedule
ru: Ограничение видимости занятия в расписании студента

source: Enter the time spent on the assignment.
ru: Введите время, затраченное на выполнение задания.

source: Enter a valid duration in a HH:MM format
ru: Введите продолжительность в HH:MM формате.

source: Deadline
ru: Срок сдачи

source: Attached files
ru: Приложенные файлы

source: Passing score
ru: Проходной балл

source: Assignment Weight
ru: Вес задания

source: Assignment contribution to the course total score. It takes into account in the gradebook.
ru: Вклад задания в сумму баллов по курсу.

source: Time to Completion
ru: Время для завершения

source: Estimated amount of time required for the task to be completed
ru: Сколько, по вашему мнению, студенту потребуется времени, чтобы выполнить задание?

source: hours:minutes
ru: часы:минуты

source: Available for Groups
ru: Доступно для групп

source: Restrict assignment to selected groups. Available to all by default.
ru: Задание будет доступно только выбранным группам. По умолчанию доступно всем.

source: Checking System
ru: Проверяющая система

source: Checker URL
ru: URL проверяющей системы

source: For example, URL of the Yandex.Contest problem: https://contest.yandex.ru/contest/3/problems/A/
ru: Например, URL задачи из Яндекс.Контеста: https://contest.yandex.ru/contest/3/problems/A/

source: Selection Mode
ru: Режим назначения

source: URL is specified but checking system is empty
ru: Для URL не указана проверяющая система

source: Teachers
ru: Преподаватели

source: The location name will be added to the end if provided
ru: К имени будет добавлено название адреса, если адрес указан.

source: Learning Space
ru: Место проведения

source: Learning Spaces
ru: Места проведения занятий

source: Year
ru: Год

source: Semester|type
ru: Тип

source: Semester|StartsAt
ru: Начало семестра

source: Datetime in UTC and is predefined.
ru: Указана UTC метка времени, значение только для чтения

source: Semester|EndsAt
ru: Конец семестра

source: Semester index
ru: Порядковый номер семестра (служебное поле)

source: System field. Used for sort order and filter.
ru: Системное поле. Используется для сортировки и фильтрации.

source: Semesters
ru: Семестры

source: News|slug
ru: Имя для URL

source: Short dash-separated string for human-readable URLs, as in test.com/news/<b>some-news</b>/
ru: Короткая строка, разделённая тире, для человекочитаемых URL'ов. Пример: test.com/news/<b>some-news</b>/

source: Course|index
ru: Индекс курса

source: Short unique index of course
ru: Уникальный индекс курса

source: Course|short_description
ru: Краткое описание

source: MetaCourse|cover
ru: Обложка

source: System
ru: Системный

source: Manual
ru: Ручной

source: Invitation
ru: Приглашение

source: No Groups
ru: Без групп

source: Invitations and Branches
ru: Приглашения и Отделения

source: In the first half of semester
ru: В первой половине семестра

source: In the second half of semester
ru: Во второй половине семестра

source: Full semester
ru: Полный семестр

source: CourseOffering|grading_type
ru: Система оценивания

source: CourseOffering|learners_capacity
ru: Максимальное кол-во сдающих

source: 0 - unlimited
ru: 0 - без ограничений

source: CourseOffering|listeners_capacity
ru: Максимальное кол-во слушателей

source: Enrollment|type
ru: Тип

source: CourseOffering|hours
ru: Кол-во часов

source: Starts on
ru: Первый день

source: If left blank the start date of the semester is used
ru: Если оставить пустым, то будет использована дата начала записи семестра

source: Closing Day
ru: Последний день

source: If left blank the closing date of the semester is used
ru: Если оставить пустым, то будет использована дата конца записи семестра

source: Course|teachers
ru: Преподаватели

source: Duration
ru: Продолжительность

source: Duration of course
ru: Продожительность курса

source: Enrollment|default_grade
ru: Оценка по-умолчанию

source: Date of completion
ru: Дата завершения

source: Consider the course as completed from the specified day (inclusive).
ru: Укажите день, начиная с которого курс считается завершенным. По умолчанию - первый день следующего семестра.

source: LaTeX+Markdown+HTML is enabled
ru: Доступны LaTeX для формул, Markdown и HTML

source: Internal Information
ru: Информация для слушателей курса

source: Visible to course listeners only. LaTeX+Markdown+HTML is enabled.
ru: Поле увидят только слушатели курса. Доступны LaTeX для формул, Markdown и HTML

source: Contacts
ru: Контакты

source: Survey URL
ru: URL опроса

source: Leave empty if you want to fetch survey url from DB
ru: Если оставить пустым, то ссылка будет генерироваться на основе последнего активного опроса.

source: Online Course URL
ru: URL онлайн-курса

source: Is draft
ru: Черновик

source: Ask Enrollment Reason
ru: Спрашивать причину поступления

source: Ask a student why they wants to enroll in the course when they clicks the 'Enroll' button.
ru: При нажатии на кнопку "Записаться" студенту будет предложена форма, в которой он может указать причину записи на курс.

source: Ask Time to Completion
ru: Спрашивать TTC

source: Teacher must specify estimated amount of time required for an assignment to be completed. Student enters the actual time on submitting the solution.
ru: Преподаватель во время создания задания указывает время, необходимое на его выполнение. Студент при отправке решения должен ввести затраченное время.

source: Published in video section
ru: Публиковать в разделе «Видео»

source: Do we see this course in certificates and diplomas?
ru: Отображается ли курс в справках и дипломах

source: Main Branch
ru: Главное отделение

source: Course Branches
ru: Отделения курса

source: All branches where the course is available for enrollment
ru: Студенты указанных отделений смогут проходить курс

source: Student Group Mode
ru: Режим студенческих групп

source: Choose `Branch` to auto generate student groups from course branches.
ru: Выберите "Отделение" для генерации студенческих групп из отделений курса.

source: Language
ru: Язык

source: The language in which lectures are given.
ru: Укажите язык прочтения лекций.

source: Materials Visibility
ru: Видимость материалов

source: Default visibility for class materials.
ru: Видимость материалов занятий по умолчанию

source: Translation link
ru: Ссылка на трансляцию

source: Public Slides
ru: Публичные слайды

source: Public Attachments
ru: Публичные приложения

source: Course offering
ru: Прочтение курса

source: Course offerings
ru: Прочтения курсов

source: Deadline should be later than the start of the enrollment period
ru: Последний день записи на курсы должен быть не раньше первого дня записи на курсы

source: You can not set listeners capacity with REGULAR enrollment type
ru: Вы не можете выставить максимальное кол-во слушателей с типом "Сдавать"

source: You can not set learners capacity with LECTIONS_ONLY enrollment type
ru: Вы не можете выставить максимальное кол-во сдающих с типом "Только слушать"

source: Course Branch
ru: Отделение курса

source: Notifications
ru: Уведомления

source: Course Teacher
ru: Преподаватель курса

source: Course Teachers
ru: Преподаватели курса

source: CourseReview|is_visible
ru: Отображается на странице курса

source: Author
ru: Автор

source: Course Review
ru: Отзыв о курсе

source: Course Reviews
ru: Отзывы о курсе

source: CourseNews|title
ru: Заголовок

source: CourseNews|text
ru: Текст

source: Course news-singular
ru: Новость

source: Course news-plural
ru: Новости

source: CourseClass|Venue
ru: Место проведения

source: Slides
ru: Слайды

source: Video Recording
ru: Видео

source: Both YouTube and Yandex Video are supported
ru: Поддерживаются ссылки на YouTube и Яндекс.Видео

source: Recording link
ru: Ссылка на запись

source: CourseClass|Other materials
ru: Другие материалы

source: Slides, attachments and other materials
ru: Слайды, приложенные файлы и др.

source: Groups
ru: Группы

source: Course class teachers
ru: Преподаватели занятия

source: Is conducted by invited
ru: Приглашенный спикер

source: Invited teacher first name
ru: Имя приглашенного спикера

source: Invited teacher last name
ru: Фамилия приглашенного спикера

source: Classes
ru: Занятия

source: Class should end after it started
ru: Конец занятия должен быть позже начала

source: slides
ru: слайды

source: video
ru: видео

source: files
ru: файлы

source: other
ru: другое

source: recording
ru: запись

source: Class attachment
ru: Приложение к занятию

source: Class attachments
ru: Приложения к занятию

source: Assignment Format
ru: Формат задания

source: Assignment|name
ru: Название

source: Assignment|text
ru: Текст

source: Assignee mode
ru: Режим назначения

source: Automatic assignment mode of a responsible teacher
ru: Режим автоматического назначения ответственного преподавателя

source: Assignment Assignees
ru: Ответственные за задание

source: Has lower priority than student group assignees
ru: Приоритет ниже, чем у ответственных за студенческие группы

source: Assignments
ru: Задания

source: Course modification is not allowed
ru: Изменение курса запрещено

source: Passing score should be less than (or equal to) maximum one
ru: Проходной балл должен быть меньше или равен максимальному баллу

source: Assignment attachment
ru: Приложение к заданию

source: Assignment attachments
ru: Приложения к заданиям

source: CourseTab|About
ru: О курсе

source: CourseTab|Classes
ru: Занятия

source: CourseTab|Assignments
ru: Задания

source: Course is already published
ru: Прочтение курса уже опубликовано

source: Course is succesfully published
ru: Прочтение курса успешно опубликовано

source: Form error. is_repeated is False and number_of_repeats is not 1
ru: Ошибка формы. Флаг не выставлен, но кол-во повторений указано.

source: The class "{name}" was successfully created.
ru: Занятие "{name}" было успешно создано.

source: The classes "{name}" from {from_date} to {to_date} were successfully created.
ru: Занятия "{name}" от {from_date} до {to_date} были успешно созданы.

source: The class '%s' was successfully updated.
ru: Занятие '%s' успешно обновлено.

source: News was successfully created
ru: Новость успешно добавлена

source: News wasn't created. Try again.
ru: Новость не была создана! Неизвестная ошибка.

source: Sort order
ru: Сортировка

source: Category
ru: Категория

source: Categories
ru: Категории

source: Question
ru: Вопрос

source: Answer
ru: Ответ

source: Questions
ru: Вопросы

source: Student
ru: Студент

source: New
ru: Создана

source: Not Submitted
ru: Не удалось отправить

source: Checking
ru: Тестируется

source: Wrong Answer
ru: Не пройдена

source: Correct Answer
ru: Пройдена

source: CheckingSystem|Name
ru: Название проверяющей системы

source: CheckingSystem|Type
ru: Тип проверяющей системы

source: What can it be used for?
ru: Для чего она может быть использована?

source: CheckingSystem|Details
ru: Параметры проверяющей системы

source: Access token, etc
ru: Токен доступа и пр.

source: Checking Systems
ru: Проверяющие системы

source: Access token should be specified,or participant's OAuth token shouldbe used for submission.
ru: Должен быть либо указан токен доступа, либо для отправки должен использоваться OAuth-токен студента.

source: Checker|URL
ru: URL проверяющей системы

source: Checker|Settings
ru: Настройки проверяющей системы

source: Contest id, problem id, etc
ru: ID контеста, задачи и пр.

source: Checker
ru: Конфигурация проверяющей системы

source: Checkers
ru: Конфигурации проверяющей системы

source: Please check that the following settings are provided: {}
ru: Убедитесь, что указаны следующие настройки: {}

source: Assignment Submission
ru: Посылка к заданию

source: Status
ru: Статус

source: Settings
ru: Настройки

source: Selected compiler, etc
ru: Выбранный компилятор и пр.

source: Meta
ru: Мета-информация

source: Returned submission id or error details
ru: Возвращаемая информация (ID посылки, описание ошибки)

source: Submission
ru: Посылка

source: Submissions
ru: Посылки

source: Requeue check in 10 minutes
ru: Повторная попытка через 10 минут

source: Checking failed after all retries
ru: Проверка не удалась после всех повторных попыток

source: Yandex.Contest api error
ru: Ошибка Яндекс.Контест API

source: Duplicate submission
ru: Дублирующая отправка

source: Unknown Yandex.Contest api error
ru: Неизвестная ошибка Яндекс.Контест API

source: Inner fail
ru: Внутренняя ошибка

source: unknown Yandex.Contest api error
ru: Неизвестная ошибка Яндекс.Контест API

source: Remote check for local submission has failed!
ru: Удаленная проверка отправки не удалась

source: Requeue check
ru: Повторная попытка

source: Not a Yandex.Contest URL
ru: Не является URL Яндекс.Контеста

source: Contest ID should be positive
ru: ID контеста должен быть положительным

source: URL does not contain ID of the problem
ru: URL не содержит ID задачи

source: Infoblock Tags
ru: Теги

source: Infoblocks
ru: Инфоблоки

source: Infoblock Tag
ru: Тег инфоблока

source: Content
ru: Содержимое

source: Infoblock
ru: Инфоблок

source: Assignment|assigned_to
ru: Задано

source: Asssignment|name
ru: Название

source: Enrollment|grade changed
ru: Оценка изменена

source: Watchers
ru: Наблюдатели

source: Watcher
ru: Наблюдатель

source: Invitation Link
ru: Ссылка с приглашением

source: Score can't be larger than %s
ru: Оценка не может быть больше %s

source: Invalid course teacher %s
ru: Невалидный преподаватель курса %s

source: Learning
ru: Обучение

source: Comment
ru: Комментарий

source: Please select a valid status
ru: Пожалуйста, выберите разрешенный статус.

source: Form is empty.
ru: Недостаточно данных.

source: Time Spent on Assignment
ru: Время, затраченное на выполнение задания

source: Requires the full format including minutes. Do not include the time of previous submissions.
ru: Укажите полный формат HH:MM. Время предыдущих посылок учитывать не нужно.

source: Send Solution
ru: Отправить решение

source: Either text or file should be non-empty
ru: Требуется текст или приложенный файл

source: File name is not provided
ru: Не указано имя файла

source: `%(value)s` file name has no extension
ru: У имени файла `%(value)s` не найдено расширение

source: Compiler
ru: Компилятор

source: Solution file
ru: Файл решения

source: File should be non-empty
ru: Должен быть прикреплен файл

source: Text should be non-empty
ru: Требуется текст

source: Gallery
ru: Галерея

source: Album
ru: Альбом

source: File
ru: Файл изображения

source: Image
ru: Изображение

source: Images
ru: Изображения

source: Slug
ru: Символьный код

source: Short name in ASCII, used in images upload path
ru: Уникальное имя альбома в ASCII-кодировке.

source: Brief
ru: Краткое описание

source: Short description
ru: Краткое описание

source: Head
ru: Превью

source: Set semester for album and all uploaded images will inherit it.
ru: Если установить семестр для альбома, то для всех загружаемых фото в него можно его не указывать.

source: Parent
ru: Родитель

source: Parent album
ru: Родительский альбом

source: Albums
ru: Альбомы

source: Empty album
ru: Пустой альбом

source: Header '{}' not found
ru: Заголовок '{}' не найден

source: Invalid score format '{}'
ru: Неверный формат оценки '{}'

source: Last name
ru: Фамилия

source: Learners
ru: Сдающие

source: Total students
ru: Всего

source: Recredited
ru: Перезачеты

source: Listeners
ru: Слушатели

source: Gradebook successfully saved.
ru: Ведомость успешно сохранена.

source: Gradebook hasn't been saved.
ru: Ведомость не была сохранена.

source: Enrollment ID
ru: ID записи на курс

source: First name
ru: Имя

source: Patronymic
ru: Отчество

source: Role
ru: Роль

source: Email
ru: Почта

source: Enrollment type
ru: Тип записи

source: CSCUser|Curriculum year
ru: Год программы обучения

source: Group
ru: Группа

source: Yandex Login
ru: Логин на Яндексе

source: Telegram Username
ru: Telegram

source: Final grade
ru: Итоговая оценка

source: Total
ru: Сумма баллов

source: Imported records for assignment {} - {} out of {}
ru: Импортировано оценок за задание {} - {} из {} найденных

source: <b>Not all records were processed. Import stopped by an error:</b><br>
ru: <b>Не все записи были обработаны. Импорт прекращён из-за ошибки:</b><br>

source: Events
ru: События

source: Submit
ru: Отправить

source: Continue
ru: Продолжить

source: Invitation is outdated
ru: Приглашение просрочено

source: Group Type
ru: Тип группы

source: Enrollment key
ru: Код записи на курс

source: Assignee
ru: Проверяющий

source: Student Group Assignee
ru: Ответственный студенческой группы
