Repository: cscenter/lms
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Import stepik statements
ru: Импортировать баллы по stepik.org ID

source: Select assignment
ru: Выбрать задание

source: Select csv file
ru: Выбрать csv-файл

source: Import yandex statements
ru: Импортировать баллы по Яндекс-логину

source: Marks sheet
ru: Ведомость

source: Students
ru: Студенты

source: Grades
ru: Итоговая оценка

source: Profile
ru: Профиль

source: Logout
ru: Выйти

source: Members Area
ru: Личный кабинет

source: Time
ru: Время

source: No classes yet
ru: Список занятий пуст

source: %(counter)s point
ru: %(counter)s балл

source: Volunteer
ru: Вольный слушатель

source: Student search
ru: Поиск студентов

source: Name, full or partial
ru: Имя, целиком или часть

source: Passed courses
ru: Сданные курсы

source: University graduation year for graduates without diploma
ru: Год выпуска из ВУЗа выпускников без диплома

source: Any
ru: Любой

source: No assignments yet
ru: Список заданий пуст

source: Open assignments
ru: Открытые задания

source: State
ru: Статус

source: Archive
ru: Архив

source: Listener
ru: Слушатель

source: Start survey!
ru: Оставить отзыв

source: Leave course
ru: Покинуть курс

source: Enroll
ru: Записаться

source: Comment doesn't change status.<br> For the teacher to see an update to the solution, use the «Send solution» tab.
ru: Комментарий не меняет статус задания.<br> Чтобы преподаватель увидел обновление к решению, используйте окно «Добавить решение».

source: Professor
ru: Преподаватель

source: Professors
ru: Преподаватели

source: out of
ru: из

source: Assignment created
ru: Задание добавлено

source: Student answers
ru: Комментарии студентов

source: Estimated Execution Time
ru: Оценочное время выполнения

source: Mean Execution Time
ru: Среднее время выполнения

source: Median Execution Time
ru: Медианное время выполнения

source: Next unchecked[assignment]
ru: Следующее непроверенное

source: No value is specified
ru: Не указано

source: Profile photo
ru: Фото профиля

source: Select a file
ru: Выбрать изображение

source: Back to upload
ru: Назад к загрузке фото

source: Masters degree
ru: В рамках магистратуры

source: Online courses
ru: Онлайн-курсы

source: Citizenship
ru: Гражданство

source: [Change]
ru: [Изменить]

source: [Login by Yandex]
ru: [Войти через Яндекс]

source: [Account is not connected]
ru: [Аккаунт не подключён]

source: .iCal-calendar
ru: .iCal-календари

source: Status history
ru: История статусов

source: Areas of study history
ru: История направлений

source: on site
ru: на сайте

source: Change photo
ru: Изменить фото

source: Review of the Organization
ru: Отзыв

source: close all
ru: закрыть все

source: CS club course
ru: Курс CS клуба

# adjective
source: autumn
ru: осенний

# adjective
source: spring
ru: весенний
