Repository: cscenter/lms
Catalog: apps/admission/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Campaign
ru: Набор

source: Branch
ru: Отделение

source: Applicant
ru: Поступающий

source: Created
ru: Создано

source: Interviewer
ru: Собеседующий

source: Interviewers
ru: Собеседующие

source: Date
ru: Дата

source: Interview
ru: Интервью

source: Accepted
ru: Принято

source: Yes
ru: Да

source: No
ru: Нет

source: Admission
ru: Поступление

source: Rejected by form check
ru: Отказ после проверки анкеты

source: Golden ticket from the previous year
ru: Cчастливый билет прошлого года

source: Cheating
ru: Читеры (тестирование)

source: Rejected by test
ru: Отказ по результатам теста

source: Permitted to the olympiad
ru: Допущен к олимпиаде

source: Permitted to the exam
ru: Допущен к экзамену

source: Passed the olympiad
ru: Прошел олимпиаду

source: Failed the olympiad, will write the exam
ru: Экзамен после олимпиады

source: Rejected by exam cheating
ru: Читеры (экзамен)

source: Rejected by exam
ru: Отказ по результатам экзамена

source: Passed the exam
ru: Сдал экзамен

source: Rejected by interview
ru: Отказ по результатам собеседований

source: Rejected by interview. Offered a bonus
ru: Отказ по результатам собеседований. Предложили счастливый билет

source: Accept
ru: Принимаем

source: Accept with condition
ru: Принимаем с условием

source: He or she refused
ru: Отказался

source: Permitted to the intensive
ru: Прошел на интенсив

source: Pending
ru: Ожидает решения

source: Rejected by intensive
ru: Отказ по результатам интенсива

source: Rejected by intensive. Offered a bonus
ru: Отказ по результатам интенсива. Предложили счастливый билет

source: Accept on paid
ru: Платное

source: Entering the master's program (pre-selection)
ru: Поступает в магистратуру (предотбор)

source: Passed the exam (pre-selection)
ru: Прошел экзамен (предотбор)

source: Rejected by exam (pre-selection)
ru: Отказ после экзамена (предотбор)

source: Recommended for the master's program (pre-selection)
ru: Рекомендован в магистратуру (предотбор)

source: Rejected by interview (pre-selection)
ru: Отказ после собеседования (предотбор)

source: Accepted for the master's program (pre-selection)
ru: Поступил в магистратуру (предотбор)

source: Refused to enroll the master's program (pre-selection)
ru: Отказ при зачислении (предотбор)

source: Testing
ru: Тестирование

source: Exam
ru: Экзамен

source: Olympiad
ru: Олимпиада

source: Not registered in the contest
ru: Не зарегистрирован в контесте

source: Syncing with a contest
ru: Синхронизация с контестом

source: Manual score input
ru: Ручной ввод баллов

source: Offline
ru: Очно

source: Online
ru: Онлайн

source: Any
ru: Любой

# section
source: Common Section
ru: Общая секция

# section
source: Math
ru: Математика

# section
source: Code
ru: Код

# section
source: Math and code
ru: Математика+код

# section
source: Motivation
ru: Мотивация

source: No Response
ru: Нет ответа

source: Declined
ru: Отклонено

source: Expired
ru: Истекло

source: bachelor
ru: Бакалавр

source: speciality
ru: Специалист

source: magistracy
ru: Магистр

source: postgraduate
ru: Аспирант

source: secondary professional
ru: Диплом СПО

source: yes
ru: Да

source: in process of getting degree
ru: В процессе получения диплома

source: no
ru: Нет

source: Basiс track
ru: Базовый трек

source: Advanced track
ru: Продвинутый трек

source: Approved and completed
ru: Согласованные и завершенные

source: Status
ru: Статус

source: Surname
ru: Фамилия

source: Filter
ru: Фильтровать

source: Interview Section
ru: Секция

source: Regular
ru: Классический

source: Alternative
ru: Альтернативный

source: Golden ticket
ru: Cчастливый билет

source: Interview format
ru: Формат собеседования

source: Applicant track
ru: Трек абитуриента

source: Applicant way to interview
ru: Путь к собеседованию

source: Applicant number of missed interviews
ru: Кол-во пропусков собес-ния

source: Last Name
ru: Фамилия

source: Interview Streams
ru: Потоки собеседований

source: Show
ru: Показать

source: University
ru: Вуз

source: Create interview
ru: Создать собеседование

source: Interview streams
ru: Потоки собеседований

source: Send
ru: Отправить

source: Update assignments list
ru: Обновить список заданий

source: Is Cancelled
ru: Не состоялось

source: Save
ru: Сохранить

source: Sorry, but you should be in interviewers list to create or update comment.
ru: Вы не входите в список собеседующих данное интервью и не можете оставить комментарий.

source: Update
ru: Обновить

source: Code
ru: Код

source: Authorization code is invalid.
ru: Неправильный код авторизации

source: Birthday
ru: Дата рождения

source: Yandex Login
ru: Логин на Яндексе

source: Has no patronymic
ru: Нет отчества

source: Admission track
ru: Трек поступления

source: Authorization code is not valid
ru: Неверный код авторизации

source: Email verification code is not valid
ru: Неверный проверочный код

source: Email template with name `%(template_name)s` doesn't exist
ru: Шаблон письма с именем `%(template_name)s` не найден.

source: Campaign|Year
ru: Год набора

source: Current Admission
ru: Текущий набор

source: You can mark campaign as current only after adding contests for testing
ru: Возможность сделать набор текущим появится после добавления контестов для этапа тестирования.

source: Order
ru: Сортировка

source: Campaign|Test_max_score
ru: Максимальный балл по тесту

source: Campaign|Test_passing_score
ru: Проходной балл по тестированию

source: Campaign|Test_passing_score-help
ru: Все результаты >= указанного числа проходят в следующий этап.

source: Campaign|Exam_max_score
ru: Максимальный балл по экзамену

source: Campaign|Exam_passing_score
ru: Проходной балл по экзамену

source: Campaign|Exam_passing_score-help
ru: Все результаты >= указанного порога гарантированно пройдут на следующий этап.

source: Application Starts on
ru: Начало приема заявок

source: Application Ends on
ru: Окончание приема заявок

source: Last day for submitting application
ru: Дедлайн отправки анкеты

source: Confirmation Ends on
ru: Подтверждение поступления заканчивается

source: Deadline for accepting invitation to create student profile
ru: Дедлайн создания студенческого профиля после приема на учебу

source: Access Token
ru: Токен доступа

source: Yandex.Contest Access Token
ru: Access token для регистрации пользователей в Яндекс.Контесте. Владелец токена должен иметь права админа в контестах.

source: Yandex.Contest Refresh Token
ru: Токен для обновления access token

source: Registration Template
ru: Шаблон регистрации

source: Template name for contest registration email
ru: После заполнения анкеты пользователь получает письмо с деталями проведения приемной кампании.

source: MIPT Advanced Registration Template
ru: Шаблон регистрации продвинутого трека магистратуры МФТИ

source: Template name for contest registration email for MIPT Advanced track applicants
ru: После заполнения анкеты пользователь получает это письмо, если поступает на продвинутый трек магистратуры МФТИ

source: Exam Invitation Email Template
ru: Шаблон приглашения на экзамен

source: Template name for the exam registration email
ru: Шаблон письма с приглашением пройти экзамен

source: Invitation Template
ru: Шаблон приглашения

source: Template name for interview invitation email
ru: Шаблон письма с приглашением выбрать время собеседования.

source: Interview Feedback Template
ru: Шаблон отзыва о собеседовании

source: Leave blank if there is no need to send a feedback email. Email will be sent at the time of interview status change, but not earlier than 21:00 of the day of the interview
ru: Оставьте значение пустым, если не нужно отправлять письмо после завершения собеседования. Если шаблон указан, то письмо будет отправлено после выставления статуса завершения собеседования, но не раньше 21:00 дня собеседования.

source: Campaigns
ru: Кампании по набору

source: You can't set `current` on campaign creation
ru: Нельзя сделать кампанию сразу активной. Как минимум сперва нужно создать контесты.

source: Before mark campaign as `current` - add contests for testing
ru: Не найдены контесты для этапа тестирования.

source: Empty access token
ru: Не указан access token админа контестов (значение не валидируется, только проверяется его наличие)

source: Perhaps also the faculty.
ru: Возможно и факультет

source: University abbreviation
ru: Аббревиатура

source: Sort order
ru: Сортировка

source: Universities
ru: Университеты

source: Applicant|Campaign
ru: Набор

source: Applicant|Status
ru: Статус

source: Account
ru: Пользователь

source: First name
ru: Имя

source: Patronymic
ru: Отчество

source: Applicant photo
ru: Фото

source: Applicant|photo
ru: Фотография поступающего

source: Email
ru: Электронная почта

source: Applicant|email
ru: Адрес электронной почты

source: Unsubscribed
ru: Отписан от уведомлений

source: Unsubscribe from future notifications
ru: Пользователь отказался от рассылок по поводу приёмной кампании

source: Contact phone
ru: Контактный телефон

source: Applicant|phone
ru: Телефон для связи

source: Residence city
ru: Город проживания

source: Living Place
ru: Место проживания

source: Date of Birth
ru: Дата рождения

source: Stepik ID
ru: stepik.org ID

source: Applicant|stepic_id
ru: ID на stepic.org

source: Applicant|yandex_login
ru: Многие сервисы Яндекса используют единый аккаунт https://passport.yandex.ru

source: Yandex Login (normalized)
ru: Логин на Яндексе (нормализованный)

source: Applicant|yandex_id_normalization
ru: Нормализация яндекс логина для поиска анкет

source: Github Login
ru: Логин на github.com

source: Applicant|github_login
ru: Ссылка на github-аккаунт

source: Partner
ru: Партнёрская программа

source: MIPT track
ru: Трек поступления (МФТИ)

source: MIPT GPA
ru: Средний балл (МФТИ)

source: MIPT expectations
ru: Ожидания (МФТИ)

source: MIPT grades file
ru: Оценки (МФТИ)

source: Are you studying?
ru: Вы учитесь?

source: Are applying for alternative track?
ru: Поступает на альтернативный трек

source: Alternative track info
ru: Информация для альтернативного трека

source: Applicant|alternative_track_info
ru: Опишите ваш опыт работы в IT-сфере (разработка, аналитика) после получения диплома в формате:период работы, компания, должность, обязанности

source: Has diploma
ru: Есть ли диплом

source: Applicant|has_diploma
ru: Есть ли у вас диплом?

source: Degree of diploma
ru: Степень диплома

source: Applicant|diploma_degree
ru: Укажите степень вашего диплома

source: Universities|University
ru: Университет

source: Applicant|University
ru: Университет (и иногда факультет)

source: University (Other)
ru: Университет, другое

source: Faculty
ru: Факультет

source: Applicant|faculty
ru: На каком факультете (кафедре/специализации) Вы учитесь или какой факультет закончили?

source: Course
ru: Курс

source: Applicant|course
ru: На каком курсе Вы сейчас учитесь?

source: Course (other)
ru: Курс (другое)

source: Graduation Year
ru: Год выпуска

source: Graduate work
ru: Выпускная работа

source: Applicant|graduate_work_or_dissertation
ru: Название текущей курсовой, дипломной работы или диссертации (если есть), руководитель

source: Online Education Exp
ru: Вы проходили какие-нибудь онлайн-курсы? Какие? Какие удалось закончить?

source: Applicant|online_education_experience
ru: Вы проходили какие-нибудь онлайн-курсы? Какие? Какие удалось закончить?

source: Experience
ru: Опыт программирования или научной работы

source: Applicant|work_or_study_experience
ru: Опишите Ваш опыт программирования или научной работы

source: Have you had an internship?
ru: Вы проходили стажировки в компаниях?

source: Applicant|Has internship
ru: Проходил стажировки

source: Internship workplace
ru: Компания, где вы стажировались

source: Applicant|Internship workplace
ru: Место стажировки

source: Internship position
ru: Должность на стажировке

source: Applicant|Internship position
ru: Должность на стажировке

source: Date of the internship beginning
ru: Дата начала стажировки

source: Date of the internship end
ru: Дата окончания стажировки

source: Does your internship still going?
ru: На стажировке

source: Applicant|internship_not_ended
ru: Стажируется ли до сих пор

source: Do you work?
ru: Работает

source: Applicant|has_job
ru: Работает ли в данный момент

source: Workplace
ru: Место работы

source: Applicant|workplace
ru: Место работы

source: Position
ru: Должность

source: Applicant|position
ru: Должность

source: Working hours
ru: Количество рабочих часов в неделю

source: Your motivation
ru: Мотивация поступающего

source: Applicant|motivation_why
ru: Почему Вы хотите обучаться у нас?

source: Probability
ru: Что нужно для выпуска из CS центра? Оцените вероятность, что вы сможете это сделать

source: Applicant|probability
ru: Что нужно для выпуска из CS центра? Оцените вероятность, что вы сможете это сделать

source: Study program
ru: Предполагаемые направления обучения

source: Applicant|study_program
ru: Выберите направления обучения, которые Вам интересны в CS центре

source: Study Program Notes
ru: Комментарии к направлениям обучения

source: Study program (DM note)
ru: Направление "Анализ данных" (подробнее)

source: Applicant|study_program_dm
ru: Почему вам интересен анализ данных? Какие повседневные задачи решаются с помощью анализа данных?

source: Study program (SE note)
ru: Направление "Разработка ПО" (подробнее)

source: Applicant|study_program_se
ru: В разработке какого приложения, которым вы пользуетесь каждый день, вы хотели бы принять участие? Почему? Каких знаний вам для этого не хватает?

source: Study program (CS note)
ru: Какие области Computer Science вам интересно было бы изучить?

source: Applicant|study_program_cs
ru: Вы можете посмотреть список возможных тем и руководителей НИРов у нас на сайте: https://compscicenter.ru/projects/

source: Where did you learn about admission?
ru: Откуда вы узнали о наборе?

source: Where did you learn about admission? (other)
ru: Откуда вы узнали о наборе? (другое)

source: Future plans
ru: Планы после обучения

source: Applicant|future_plans
ru: Чем вы планируете заниматься после окончания обучения?

source: Additional Info
ru: Дополнительная информация

source: Applicant|additional_info
ru: Если хотите, напишите любую дополнительную информацию, которая могла бы помочь Вам поступить

source: Admin note
ru: Заметка о поступающем

source: Applicant|admin_note
ru: Например, вопросы по заявке

source: Interview Format
ru: Формат собеседования

source: Applicant|interview_format
ru: Желаемый формат интервью

source: Count of missed interviews
ru: Количество пропусков собеседования

source: Applicant|miss_count
ru: Увеличивается, когда человек отклоняет приглашение, не отвечает на него или не приходит на собеседование

source: Data
ru: Специфичные для кампании набора поля

source: Applicants
ru: Анкеты

source: An active applicant with this email already exists in this campaign.
ru: Анкета с такой почтой уже существует и активна в этой наборной кампании.

source: Applicant Status Log
ru: Лог изменения статуса абитуриента

source: Applicant Status Logs
ru: Логи изменения статуса абитуриента

source: Contest|Campaign
ru: Кампания по набору

source: Type
ru: Тип

source: Contest #ID
ru: #ID Контеста

source: Applicant|yandex_contest_id
ru: ID Яндекс.Контеста

source: Details
ru: Детали

source: Assignments in pdf format
ru: Pdf-файл с заданиями

source: Contest
ru: Контест

source: Contests
ru: Контесты

source: Participant ID
ru: ID участника

source: participant_id in Yandex.Contest
ru: participant_id в Яндекс.Контесте

source: Choose `manual score input` to avoid synchronization with contest results
ru: "Ручной ввод" отключает синхронизацию балла с контестом.

source: Score
ru: Оценка

source: Testing Result
ru: Результат тестирования

source: Testing Results
ru: Результаты тестирования

source: Exams
ru: Результаты экзамена

source: Math Score
ru: Оценка за математику

source: Location
ru: Площадка

source: Olympiad Result
ru: Результат олимпиады

source: Olympiad Results
ru: Результаты олимпиады

source: InterviewAssignments|Campaign
ru: Кампания по набору

source: InterviewAssignments|name
ru: Название

source: Assignment description
ru: Описание

source: TeX support
ru: Поддерживается TeX

source: Assignment solution
ru: Решение

source: Interview assignment
ru: Задание для интервью

source: Interview assignments
ru: Задания для интервью

source: Format Name
ru: Название формата

source: Confirmation Template
ru: Шаблон подтверждения

source: Template for confirmation email that the interview was scheduled. Leave blank if there is no need to send confirmation email
ru: Оставьте пустым, если не требуется отправлять письмо с подтверждением того, что собеседование было успешно создано.

source: Reminder Template
ru: Шаблон напоминания

source: Template for interview reminder email. Notification will be generated only on interview creation through slots mechanism.
ru: Шаблон письма с напоминанием о предстоящем собеседовании. Напоминание будет сгенерировано только при создании интервью через механизм потоков/слотов.

source: Remind Before Start
ru: Напомнить за

source: Helps to calculate schedule time of the reminder. Specify timedelta that will be subtracted from the interview start time.
ru: Указанная дельта времени помогает вычислить время отправки напоминания и будет вычтена из времени начала собеседования.

source: Interview Formats
ru: Форматы собеседований

source: Approval
ru: Согласование

source: Deferred
ru: Отложено

source: Canceled
ru: Отменено

source: Approved
ru: Согласовано

source: Completed
ru: Завершено

source: Interview|Section
ru: Секция

source: When
ru: Дата интервью

source: Interview|Slot duration
ru: Длительность (мин)

source: Interview|Status
ru: Статус собеседования

source: Venue
ru: Место проведения собеседования

source: Interview|Interviewers
ru: Собеседующие

source: Interview|Assignments
ru: Задания для интервью

source: Secret code
ru: Секретный код

source: Note
ru: Доп. информация

source: Interviews
ru: Собеседования

source: Text
ru: Комментарий

source: Comment
ru: Комментарий

source: Comments
ru: Комментарии к собеседованию

source: Interview day
ru: День проведения

source: Period start
ru: Начало потока

source: Period end
ru: Конец потока

source: Slot duration
ru: Длительность слота (мин)

source: Interview venue
ru: Место

source: Has assignments
ru: С заданиями

source: Based on this flag, student should arrive 30 min before or not
ru: Если отмечено, то в уведомлении будет указано время собеседования на полчаса раньше.

source: Maximum number of slots preffered by interviewer
ru: Максимальное количество собеседований в день

source: Applicant|interviewers_max
ru: При достижении поток не предлагается. Пустой игнорируется

source: Interview stream
ru: Поток собеседований

source: Interview format settings are not found. Create settings <a href='{}'>here</a>.
ru: Настройки формата собеседования для указанной кампании не найдены. Создать настройки можно <a href='{}'>здесь</a>.

source: Stream duration can't be less than slot duration
ru: Длительность потока должна быть больше, чем длительность хотя бы одного слота.

source: Interview start
ru: Начало

source: Interview end
ru: Окончание

source: Interview slot
ru: Слот для собеседования

source: Interview slots
ru: Слоты для собеседований

source: Expired at
ru: Истекает

source: Interview invitation
ru: Приглашение на собеседование

source: Interview invitations
ru: Приглашения на собеседования

source: Waiting for Confirmation
ru: Ожидаем подтверждения

source: Confirmed
ru: Подтверждено

source: Authorization Code
ru: Код авторизации

source: Acceptance for Studies
ru: Запись о поступлении

source: Acceptances for Studies
ru: Записи о поступлении

source: External ID
ru: Внешний ID

source: Name
ru: Название

source: Country
ru: Страна

source: Residence City
ru: Город проживания

source: Residence Cities
ru: Города проживания

source: City
ru: Город

source: Campaign Available in City
ru: Отделение в городе

source: Campaigns Available in City
ru: Отделения, доступные в городе

source: Interviewer [Admission]
ru: Собеседующий [Набор]

source: Interview slot not found
ru: Слот для собеседования не найден

source: Interview slot is not associated with the invitation
ru: Слот для собеседования не связан с указанным приглашением

source: Edit
ru: Редактирование

source: Created {} olympiad records and registered {} applicants in the contest.
ru: Создано {} результатов олимпиады и зарегистрировано {} поступающих на контест.

source: Current campaign
ru: Активный набор

source: All campaigns
ru: Все наборы

source: Section
ru: Секция
