Repository: cscenter/lms
Catalog: compsciclub_*/locale/*/LC_MESSAGES/django.po
Languages: ru

source: International Schools
ru: Международные школы

source: InternationalSchool|name
ru: Название

source: InternationalSchool|Link
ru: Ссылка

source: InternationalSchool|place
ru: Место проведения

source: InternationalSchool|Deadline
ru: Дедлайн

source: InternationalSchool|Start
ru: Начало

source: InternationalSchool|End
ru: Конец

source: InternationalSchool|Grants
ru: Гранты

source: Submit
ru: Отправить

source: Description
ru: Описание

source: Enroll in the course to get notifications and to be able to submit home assignments.
ru: Запишитесь на курс, чтобы получать уведомления и иметь возможность сдавать домашние задания. Для записи требуется регистрация на сайте.

source: Register to enroll now
ru: Перейти к регистрации

source: Login
ru: Войти

source: Class|Name
ru: Занятие

source: Lecture
ru: Лекция

source: Courses
ru: Курсы

source: No courses yet
ru: Курсов пока нет

source: Author photo
ru: Автор фото

source: Andrey Salnikov
ru: Андрей Сальников

source: The main goal of the Club is to provide undergraduate and graduate students, as well as professionals, access to high quality education in the area of Computer Science. Attendance is open to everyone and is free of charge.
ru: <p>Computer Science клуб — это открытые лекции и курсы. В клубе любой желающий может познакомиться с классическими результатами, современным положением дел и открытыми задачами в различных областях Computer Science. Вход на лекции свободный, регистрация не требуется, посещать курсы можно начать в любое время.</p>

source: The main goal of the Club is to provide undergraduate and graduate students, as well as professionals, access to high quality education in the area of Computer Science. Attendance is open to everyone and is free of charge.
ru: <p>Computer Science клуб — это открытые лекции и курсы. В клубе любой желающий может познакомиться с классическими результатами, современным положением дел и открытыми задачами в различных областях Computer Science. Вход на лекции свободный, регистрация не требуется, посещать курсы можно начать в любое время.</p>

source: Course name
ru: Название курса

source: Teachers
ru: Преподаватели

source: Next lecture
ru: Следующая лекция

source: Language
ru: Язык

source: The course is completed
ru: Курс завершён

source: To be announced
ru: Дата будет объявлена позже

source: Russian
ru: Русский

source: English
ru: Английский

source: Course Offerings
ru: Прочтения курсов

source: Course
ru: Курс

source: Photos
ru: Фотографии

source: Profile
ru: Профиль

source: Registration
ru: Регистрация

source: Admin
ru: Админка

source: City
ru: Город

source: close all
ru: Закрыть все

source: Account activation failed.
ru: Не удалось активировать аккаунт.

source: Account Activated
ru: Аккаунт успешно активирован.

source: Your account is now activated.
ru: Ваш аккаунт теперь активен.

source: You can log in.
ru: Вы можете войти.

source: registration
ru: регистрация

source: You (or someone pretending to be you) have asked to register an account at %(site_name)s. If this wasn't you, please ignore this email and your address will be removed from our records.
ru: С вашего email поступила заявка на регистрацию на сайте %(site_name)s. Если это были не Вы, пожалуйста, проигнорируйте письмо.

source: To activate this account, please click the following link within the next %(expiration_days)s days:
ru: Чтобы активировать аккаунт, пожалуйста, нажмите на ссылку ниже. Будьте внимательны, через %(expiration_days)s дня ключ активации будет просрочен:

source: Sincerely, %(site_name)s Management
ru: С уважением, администрация %(site_name)s

source: You (or someone pretending to be you) have asked to register an account at %(site_name)s. If this wasn't you, please ignore this email and your address will be removed from our records.
ru: С вашего email поступила заявка на регистрацию на сайте %(site_name)s. Если это были не Вы, пожалуйста, проигнорируйте письмо.

source: To activate this account, please click the following link within the next %(expiration_days)s days:
ru: Чтобы активировать эту учетную запись, перейдите по следующей ссылке в течение %(expiration_days)s дней:

source: Registration is closed
ru: Регистрация на данный момент закрыта

source: Sorry, but registration is closed at this moment. Come back later.
ru: Извините, но регистрация временно закрыта. Возвращайтесь позже.

source: Activation email sent
ru: Письмо с ключом активации успешно отправлено.

source: Please check your email to complete the registration process.
ru: Проверьте ваш почтовый ящик для завершения процесса регистрации.

source: Register for an account
ru: Регистрация аккаунта на

source: Can be passed online
ru: Можно сдать через сайт CS клуба
