Repository: cscenter/lms
Catalog: apps/projects/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Student
ru: Студент

source: Project
ru: Проект

source: Semester
ru: Семестр

source: Edit
ru: Изменить

source: Student Projects
ru: Студенческие проекты

source: StudentProject|Practice
ru: Практика

source: StudentProject|Research
ru: НИР

source: External project
ru: Внешний проект

source: Supervisor
ru: Руководитель

source: Final grade
ru: Итоговая оценка

source: Filter
ru: Фильтровать

source: Participants presentation
ru: Презентация участников

source: Supervisor grade
ru: Оценка руководителя

source: Presentation grade
ru: Оценка за презентацию

source: Type
ru: Тип

source: Report
ru: Отчет

source: Report content
ru: Текст отчета

source: New comment
ru: Новый комментарий

source: Send
ru: Отправить

source: Either text or file should be non-empty
ru: Должен быть указан текст комментария или приложен файл.

source: Complete assessment
ru: Завершить проверку

source: Save draft
ru: Сохранить как черновик

source: Complete
ru: Завершить

source: Save
ru: Сохранить

source: Label
ru: Метка

source: Helps to distinguish student reports for the project.
ru: Помогает различать отчеты студента для проекта, если их несколько.

source: Start On
ru: Дата начала

source: First day of the report period.
ru: Первый день, когда можно отправить отчет.

source: End On
ru: Дата окончания

source: The last day of the report period.
ru: Последний день отправки отчета.

source: Branch
ru: Отделение

source: StudentProject|Type
ru: Тип

source: Min score for EXCELLENT
ru: Балл на Отлично

source: Projects with final score >= this value will be graded as Excellent
ru: Если финальный балл по проекту >= указанного значения, то студент получит оценку "Отлично".

source: Min score for GOOD
ru: Балл на Хорошо

source: Projects with final score in [GOOD; EXCELLENT) will be graded as Good.
ru: Если финальный балл по проекту в диапазоне [Хорошо; Отлично), то студент получит оценку "Хорошо".

source: Min score for PASS
ru: Балл на Зачет

source: Projects with final score in [PASS; GOOD) will be graded as Pass, with score < PASS as Unsatisfactory.
ru: Если финальный балл по проекту в диапазоне [Зачет; Хорошо), то студент получит оценку "Зачет", если ниже указанного значения, то "Незачет".

source: Reporting Period
ru: Отчетный период

source: Reporting Periods
ru: Отчетные периоды

source: Integer value from -15 to 15
ru: Целое число в диапазоне от -15 до 15 включительно

source: Review from supervisor
ru: Отзыв руководителя

source: Integer value from 0 to 10
ru: Целое число от 0 до 10 включительно

source: Project student
ru: Участник проекта

source: Project students
ru: Участники проекта

source: Male
ru: Мужской

source: Female
ru: Женский

source: Full Name
ru: ФИО

source: Workplace
ru: Место работы

source: Gender
ru: Пол

source: Supervisors
ru: Руководители

source: Canceled
ru: Отменен

source: Continued without intermediate results
ru: Продолжение без промежуточных итогов

source: StudentProject|Name
ru: Название

source: City
ru: Город

source: StudentProject|Status
ru: Статус

source: Description
ru: Описание

source: Students
ru: Студенты

source: Reviewers
ru: Проверяющие

source: StudentProject|Supervisor
ru: Руководители

source: Format: Last_name First_name Patronymic, Organization
ru: Формат: Фамилия Имя Отчество, Организация

source: Supervisor presentation
ru: Презентация руководителя

source: Link to supervisor presentation
ru: URL с презентацией руководителя

source: Supported public link to Yandex.Disk only
ru: Поддерживаются только публичные ссылки на Яндекс.Диск. Задача на скачивание слайдов с диска будет проигнорирована, если слайды уже загружены локально.

source: SlideShare URL for supervisor presentation
ru: Slideshare URL с презентацией руководителя

source: Link to participants presentation
ru: URL с презентацией участников

source: SlideShare URL for participants presentation
ru: Slideshare URL с презентацией участников

source: Student project
ru: Студенческий проект

source: Student projects
ru: Студенческие проекты

source: Yes
ru: Да

source: No
ru: Нет

source: New Report
ru: Новый

source: Review
ru: Проверка

source: Waiting for final score
ru: Подведение итогов куратором

source: Completed
ru: Завершено

source: Poor commit history
ru: 0 - у студента нет коммитов в репозитории или 1-2 в начале или прямо перед отчётом

source: Normal activity
ru: 1 - активная жизнь в репозитории

source: Bad report quality and unrelated comments
ru: 0 - отчёт и комментарии к нему написаны плохо

source: Bad report quality, but sensible comments
ru: 1 - отчёт написан плохо, но комментарии полные и разумные

source: Good report quality and sensible comments
ru: 2 - отчёт и комментарии к нему написаны хорошо

source: Status
ru: Статус

source: Report file
ru: Файл отчета

source: Student activity in cvs
ru: Жизнь в репозитории

source: Note for criterion `score_activity`
ru: Заметка к критерию "Жизнь в репозитории"

source: Report's quality
ru: Качество отчета

source: Note for criterion `score_quality`
ru: Заметка к критерию "Качество отчета"

source: Final Score
ru: Финальный балл

source: Final score note
ru: Итоговый комментарий к отчету

source: Reports
ru: Отчеты

source: 0 - Does not understand the task at all
ru: 0 - совсем не понимает задачу

source: 1 - Understands, but very superficial
ru: 1 - понимает, но очень поверхностно

source: 2 - Understands everything
ru: 2 - всё понимает

source: 0 - Does not understand
ru: 0 - не понимает

source: 1 - Writing something about the usefulness
ru: 1 - ни то, ни сё, но что-то про полезность пишет

source: 2 - Understands and explains
ru: 2 - понимает и рассказывает

source: 0 - Understand only theory, or even less
ru: 0 - разобрана только теория или даже меньше

source: 1 - Some progress, but not enough
ru: 1 - что-то сделано, но кажется, что за это время можно было бы и больше

source: 2 - The normal rate of work
ru: 2 - работа идёт в разумном темпе

source: 0 - Problems not mentioned in the report
ru: 0 - никакие проблемы и их решения не указаны в отчёте

source: 1 - Problems are mentioned without any details
ru: 1- проблемы указаны, но как их решили и решили ли, непонятно

source: 2 - Problems are mentioned and explained how they been solved
ru: 2- доступно написано про возникшие трудности и про то, как с ними справились

source: 0 - Listed, but not explained why.
ru: 0 - студент не может объяснить, почему выбрал именно эти технологии или как его код встраивается в готовый

source: 1 - The student does not understand about everything and does not try to understand, but knows something
ru: 1 - студент не про всё понимает и не пытается понять, но про что-то знает, зачем или как

source: 2 - Understands why choose one or the other technology
ru: 2 - студент понимает, почему выбраны такие технологии или как устроена интеграция его наработок в существующий проект

source: 0 - Much less than what has already been done, or the student does not understand them
ru: 0 - сильно меньше, чем то, что уже сделано, или студент их не понимает

source: 1 - It seems to have plans of normal size, but does not understand what to do.
ru: 1 - вроде планы есть нормального размера, но не до конца понимает, что именно нужно сделать

source: 2 - All right with them
ru: 2 - всё в порядке с ними

source: The global task for term
ru: Глобальная задача на семестр

source: Possible uses and scenarios
ru: Возможные способы и сценарии использования

source: What has been done since the start of the project.
ru: Что было сделано с момента старта работы над проектом

source: What problems have arisen in the process.
ru: Какие проблемы возникли при работе

source: The choice of technologies or method of integration with the existing development
ru: Выбор технологий или способ интеграции с существующей разработкой

source: Future plan
ru: Планы до конца семестра

source: Note for criterion #1
ru: Заметка к критерию "Глобальная задача на семестр"

source: Note for criterion #2
ru: Заметка к критерию "Возможные способы и сценарии использования"

source: Note for criterion #3
ru: Заметка к критерию "Что было сделано с момента старта работы над проектом"

source: Note for criterion #4
ru: Заметка к критерию "Какие проблемы возникли при работе"

source: Note for criterion #5
ru: Заметка к критерию "Выбор технологий или способ интеграции с существующей разработкой"

source: Note for criterion #6
ru: Заметка к критерию "Планы до конца семестра"

source: Check if you already completed the assessment.
ru: Отметьте, если вы закончили проверку отчёта.

source: Reviews
ru: Проверка отчетов

source: Practice Criteria
ru: Оценка практик

source: ReportComment|text
ru: Текст комментария

source: LaTeX+Markdown is enabled
ru: Доступна разметка LaTeX+Markdown

source: Author
ru: Автор

source: Report comment
ru: Комментарий к отчету

source: Report comments
ru: Комментарии к отчету

source: Report successfully has been sent
ru: Отчет успешно отправлен.

source: You successfully enrolled on the project
ru: Вы успешно подписаны на проект.

source: Data not saved. Fix errors.
ru: Данные не сохранены. Исправьте ошибки.

source: Comment successfully added.
ru: Комментарий к отчету успешно добавлен.

source: The draft successfully saved.
ru: Черновик успешно сохранён.

source: The review successfully saved.
ru: Проверка отчёта успешно завершена.

source: Report was successfully updated.
ru: Отчет успешно обновлён.

source: Data not saved. Check errors.
ru: Данные не сохранены. Проверьте ошибки.

source: Status was successfully updated.
ru: Статус отчета успешно обновлён.

source: Grades successfully updated.
ru: Баллы успешно обновлены

source: The report results are summed up successfully.
ru: Итоговый комментарий сохранён успешно.
