# TODO: Test intermediate directory exists when downloading file from yandex.disk


# TODO:
# 1. Если добавили файл со слайдами и ссылку на яндекс.диск - не добавляем задачу на скачивание с яндекс.диска
# 2. Если добавили только ссылку и не было локального файла - убедиться, что есть deffered задача на аплоад на слайдшару
# 3. Если добавили ссылку и был локальный файл - не добавляем задачи
# 4. Если обновили локальный файл - убедиться, что есть задача на аплоад на слайдшару
# 5. Если был локальный файл и пустая ссылка на слайдшару - делаем попытку аплоада
# TODO: удалять старый файл на слайдшаре, если обновили локальную презентацию?
#